Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བརྗོད་དུ་མེད་པ་དག་གིས་སྔོན་གསུངས་སོ། །
en: He has been formerly taught by the blessed buddhas who are equal in number to the grains of sand in the river Gaṅgā and whose merits are ineffable.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་གི་སྙིང་པོ་མཆོག་ཏུ་གསང་བ་ཀུན་ནས་བཀྲ་ཤིས་པར་འདོད་པ།
en: He has been regarded by them as the supremely secret heart mantra of the tathāgata Ratnaketu , auspicious in every respect.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྟོད་པ་རབ་ཏུ་བསྔགས་པ་སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་དབུགས་འབྱིན་པ་སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་འཇིག་པར་བྱེད་པ་འདོད་པ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་ཡང་གང་ཞེ་ན།
en: He is praised and extolled by all the buddhas, is the relief of all beings, and is the destroyer of every evil. He grants every wish and fulfills every hope. So what is this mantra?” {14.1}

source: བར་འདིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་པར་བསྐུལ་བ་ཞེས་བྱ་བའི་འོད་ཟེར་ཕྱུང་བར་གྱུར་ཏོ། །
en: While he spoke, a ray of light called arouser of all the buddhas emerged from the tuft of hair between the eyebrows of the blessed Śākyamuni.

source: གང་འདི་ཕྱོགས་བཅུ་སྟེང་འོག་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣང་བས་ཁྱབ་པར་མཛད་དེ།
en: It illuminated all the buddhafields in the ten directions, above, below, and everywhere,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་ཚིམ་པར་མཛད་ནས་སླར་ལོག་སྟེ།
en: delighting the minds of all beings.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་དབུའི་གཙུག་ཏོར་དུ་ནུབ་པར་གྱུར་ཏོ། །
en: It then disappeared into Blessed Śākyamuni’s uṣṇīṣa .

source: བཅོམ་ལྡན་འདས་ཀྱི་གཙུག་ཏོར་ནས་ཀུན་ནས་འབར་བའི་འོད་དང་ལྡན་པའི་ལུས་ཅན་བལྟ་བར་མི་ནུས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པ་འོད་ཆེན་པོས་ཡང་དག་པར་འཕགས་པ་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱིས་ལུས་བརྒྱན་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གཟུགས་དང་ལྡན་པ།
en: Subsequently, there emerged from the same uṣṇīṣa the lord of vidyā s named One Syllable, as a form ablaze all around with the light that all ordinary beings find impossible to look at, or to lay hold of.

source: འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོའི་གཟུགས་ཅན་རིག་པའི་རྒྱལ་པོ་ཡི་གེ་གཅིག་པ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ། །
en: Out of this great effulgence emerged his body, consisting of a halo of light, displaying multiple aspects and the great form of a cakravartin. {14.2}

source: བྱུང་ནས་ནམ་མཁའི་དཀྱིལ་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ།
en: Having emerged, he illuminated the entire sky.

source: རིག་པའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་རིག་པ་དུ་མ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་འབྱིན་པར་བྱེད་པ།
en: He had a retinue of all the vidyā king s and was attended on and worshiped by many hundreds of thousands of millions of vidyā s.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་བཅོམ་ལྡན་འདས་རིན་ཆེན་ཏོག་གིས་ཡང་དག་པར་ཐོབ་པ། སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དང་འོད་དཔག་མེད་དང་བསྙེན་པར་དཀའ་བ་དང་སྤྱན་བཟང་དང་ཏོག་བཟང་དང་མེ་ཏོག་དབང་པོ་དང་གཉིད་མཐར་ཕྱིན་དང་འཇིག་རྟེན་ཐུབ་པ་དང་། གསེར་ཐུབ་ལ་སོགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་གསུངས་ཤིང་རྗེས་སུ་ཡི་རང་བ་དང་འདས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་གསུངས་ཤིང་རྗེས་སུ་ཡི་རང་བ་དེ་ཡང་གང་ཞེ་ན།
en: the One Syllable that is taught and cherished by all the tathāgatas intimately connected with Lord Ratnaketu —Śālendra­rāja, Amitābha, Duḥprasaha, Sunetra, Suketu, Puṣpendra, and the sage Supināntaloka—and also by the [three] tathāgatas starting with Kanaka; the One Syllable that is taught and celebrated by all the perfectly awakened ones who have gone beyond. What is this One Syllable? {14.4}

source: ཏདྱ་ཐཱ། ཨོཾ་བྷྲུྃ།
en: It is bhrūṁ.

source: འཇམ་དཔལ་འདི་ནི་སྙིང་པོ་དམ་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོག་སྔགས་ཐམས་ཅད་ཀྱི་རིག་པའི་འཁོར་ལོས་སྒྱུར་བ་ཡི་གེ་གཅིག་པ་ཞེས་བྱ་བ་དག་བྱེད་ཆེན་པོ་འདི་ཡང་དག་པར་བསྒྲུབས་ན་སྔགས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་ཏེ
en: “This, Mañjuśrī, is the supreme essence of all the tathāgatas. This is the great means of purification, One Syllable by name, the vidyādhara-cakravartin. When used along with him, all mantras will be successful.

source: གཞོན་ནུ་གང་ཡང་ཁྱོད་ཀྱི་ཆོ་གའི་རྒྱལ་པོའི་མཆོག་ལ་སྔགས་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པ།
en: He is, O divine youth, recommended as the secret, supreme mantra that accords with all the mantras in your excellent king of manuals.

source: མཆོག་ཏུ་གསང་བའི་མཆོག་ཡང་དག་པར་རྗེས་སུ་གནང་བ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡང་དག་པར་སྦྱོང་བར་བྱེད་པ། དང་པོ་རེ་ཞིག་སྒྲུབ་པ་པོས་ངེས་པར་འབུམ་ཕྲག་གསུམ་བཟླས་བརྗོད་བྱའོ། །
en: He is the purifier of obscurations in all rites. A practitioner must first utter this mantra three hundred thousand times,

source: དེ་ནས་ལས་རྣམས་སྔགས་དང་བཅས་པ་འདིར་གཞོན་ནུ་ཁྱོད་ཀྱི་ཆོ་གའི་རྒྱལ་པོ་ལ་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་དང་རྒྱུད་རྣམས་བསྒྲུབ་པར་བྱའོ། །
en: and then, O divine youth, the rites for all the mantras and all the worldly and transcendent mantra methods in your king of manuals will be accomplished.

source: འདིས་བསྲུང་བ་བྱས་ན་འབྱུང་པོ་ཐམས་ཅད་ཀྱིས་ཚུགས་པར་མི་འགྱུར་རོ། །
en: When protected by One Syllable, one becomes invulnerable to attacks by any being.

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་བགེགས་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་རོ། །
en: One will also not succumb to any obstacles, whether mundane or supramundane.” {14.5}

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་དེ་གསུངས་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏེ།
en: As soon as the One Syllable was pronounced by Lord Śākyamuni, all the world spheres of the great trichiliocosm shook in six different ways.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཡང་སྣང་བས་ཁྱབ་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱང་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པར་གྱུར་ཏེ། གནས་གཙང་མའི་གཞལ་མེད་ཁང་དུ་འཁོད་པར་གྱུར་ཏོ། །
en: All the buddhafields became filled with light and all the blessed buddhas dwelling there joined the circle of the great assembly gathered in the realm of the Pure Abode.

source: ས་བཅུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པའི་སེམས་ཅན་ཐམས་ཅད་དང་རིག་པའི་རྒྱལ་པོ་རྣམས་འོད་ཟེར་གྱིས་ཡང་དག་པར་བསྐུལ་ནས་ལྷགས་པར་གྱུར་ཏོ། །
en: So, too, all the bodhisattvas on the tenth level of realization who were irreversibly established in perfect awakening, all the śrāvakas and pratyeka­buddhas, all the beings possessed of great powers, roused by the light from One Syllable, the vidyārāja , arrived enthralled in the assembly.

source: དམྱལ་བ་དང་དུད་འགྲོ་དང་ཡི་དགས་ཀྱི་ངན་འགྲོ་ལ་གནས་པ་རྣམས་འོད་ཟེར་ཆེན་པོའི་སྣང་བས་རེག་ཅིང་སྣང་བར་བྱས་པས་སྡུག་བསྔལ་གྱི་ཚོར་བའི་རྒྱུན་ལ་གནས་པ་ཡིད་ཤིན་ཏུ་བདེ་བས་ཚིམ་ཞིང་སྐྱོ་བ་མེད་པར་གྱུར་ཏེ
en: And other beings living in infinite worldly realms who followed the painful destinies of hell, the hungry ghosts, and animals, were touched by the radiance of the great light. When thus illuminated, those who were acutely suffering, immersed in their painful experience, became cheered in their minds.

source: ངེས་པར་ཐེག་པ་གསུམ་ལ་གནས་པར་གྱུར་ཏོ། །
en: They entered definitively into the three vehicles. {14.6}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ལ་གཟིགས་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Then Lord Śākyamuni looked again at this great circle of the assembly and said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་ཉོན་ཅིག་རིག་པའི་རྒྱལ་པོ་འདི་རྫུ་འཕྲུལ་ཆེ་བ་དཔའ་བོ་གཅིག་པུ་ལས་ཐམས་ཅད་བྱེད་པ།
en: “Listen, Mañjuśrī, as I tell about this vidyārāja ! He possesses great magical power. As a maṇḍala deity, he is depicted without a retinue. He is suitable for all types of activity.

source: རིག་པ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པ། ཁྱོད་ཀྱི་སྔགས་དང་རྒྱུད་དང་། ཆོ་ག་རབ་འབྱམ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: He is the supreme monarch of all vidyā s and fulfills the hopes of all beings. For all the profusion of rites, he is present in the large body of rites of the mantra system associated with you.

source: སྔགས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། ཐུན་མོང་དུ་གྱུར་པ།
en: He accomplishes all mantras and is universally applicable.

source: གྲགས་པ་ཆེ་བ་དང་། སྤྲོ་བ་ཆེ་བ་དང་། སེམས་ཅན་སྒྲུབ་པ་པོའི་ཁྱད་པར་གྱི་ཐབས་དང་ཤེས་རབ་ལ་མཁས་པ་བྱང་ཆུབ་ཀྱི་ལམ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པ། མྱ་ངན་ལས་འདས་པ་ལ་རབ་ཏུ་འཇུག་པར་བྱེད་པ།
en: He is renowned as a great lord who is very energetic and is particularly skilled in the method and wisdom that benefit beings who practice. He clears up the entire path to awakening and establishes beings in nirvāṇa.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གནས་པར་བྱེད་པ། དགེ་བའི་ཚོགས་ཡང་དག་པར་འབྱུང་བར་བྱེད་པའོ། །
en: He causes one to ascend to the seat of awakening, and he [facilitates] the accumulation of virtue. {14.7}

source: འདི་ཉིད་མདོར་བསྡུ་ན། ཆོ་ག་ཞིབ་མོ་རྒྱས་པ་རས་རིས་ཀྱི་ཆོ་གའི་དཀྱིལ་འཁོར་སྒྲུབ་པའི་ཐབས། སྔོན་གྱི་སྔགས་ཀྱི་སྤྱད་པ་རྗེས་སུ་སྤྱོད་པ། གང་ལ་རབ་ཏུ་གནས་ན་སེམས་ཅན་གྱི་རིག་པའི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོ་སྒྲུབ་པར་འགྱུར་ཏེ
en: “It is his extensive ritual that I will now briefly teach, including the procedure of making his painting and his maṇḍala and how it is the means of accomplishment, and also how to practice the previously mentioned mantra conduct, established in which sentient beings will succeed in the practice of this great cakravartin,

source: རྨད་དུ་བྱུང་བ་ཆེན་པོ་སྔགས་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག་དམ་པ། འོད་བྱེད་པ། ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ། རྣམ་པར་འདྲེན་པ། འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ། སངས་རྒྱས་བཞིན་དུ་མངོན་སུམ་དུ་ཉེ་བར་བཞུགས་པ་རང་བྱུང་དུ་གྱུར་པ་མཆོག་དང་བར་མ་དང་ཐ་མའི་ལས་ཐམས་ཅད་བྱེད་པ་ཤིན་ཏུ་བདེ་བ་དམ་པ་ཤིས་པ་དང་ཞི་བར་བྱེད་པ་སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་འཇིག་པར་བྱེད་པའོ། །
en: the marvelous vidyārāja , the supreme lord of all mantras, the illuminator, the fulfiller of all wishes, the guide, the benefactor of the whole world, who, like the Buddha, appears directly, is self-arisen, and may be employed in all activities—the highest, the medium, and the minor. {14.8} “He is blissful, auspicious, Tranquil, and destroys all evil.

source: ལྷ་རྣམས་ཀྱི་ཡང་ལྷ་ཉིད་དེ། །ཐུབ་པ་རྣམས་ཀྱི་ཐུབ་པ་མཆོག །
en: He is the god of the gods And the most eminent among sages. {14.9}

source: སངས་རྒྱས་ཉི་མའི་གཉེན་གྱུར་པ། །དག་པ་འཇིག་རྟེན་རྣམ་པར་གྲགས། །
en: “He is a buddha, a sun, and a kinsman, Completely pure and renowned in the world.

source: ཆོས་ཀུན་རང་གི་ངོ་བོ་མཁྱེན། །ཡང་དག་མཐར་གྱུར་རྙོག་པ་མེད། །
en: He knows the nature of all dharmas, Belongs to the peak of existence, and is not sullied. {14.10}

source: དེ་ཡི་ཆོ་ག་མཆོག་བཤད་བྱ། །འབྱོར་པ་འདོད་པས་མཉན་པར་གྱིས། །
en: “I will now teach his best ritual, So please listen, if you desire prosperity.

source: རེ་ཞིག་དང་པོར་རས་བཟང་པོ། །སྐྱོན་རྣམས་དང་ནི་མ་འདྲེས་པ། །སར་པ་ཕྲ་བའི་ཁྱད་པར་ལྡན། །
en: To start, one should prepare a high-quality canvas, Free of hair or any adhering dirt, {14.11} “New, especially white, and with a fringe.

source: ཁ་ཚར་དང་བཅས་ཉིད་ལ་བྲི། །ཆུར་ནི་ཁྲུ་དོའི་ཚད་ཡིན་ལ། །ཞེང་དུ་ཁྲུ་གང་ཚད་དུ་བྱ། །
en: On it, one should paint as described below. The canvas should be two cubits in height And one cubit across. {14.12}

source: དེ་འདྲའི་བཟང་པོ་ཁོ་ན་ལ། །དྲི་མེད་བལྟ་ན་སྡུག་པ་དང་། །བཅོས་བུ་དཀར་པོ་དེ་བཞིན་དུ། །ཕྲ་དང་ལེགས་བཀྲུས་རས་བལ་སྤངས། །
en: “It should be as described—bright, Spotless, pleasant in appearance, Of pure white color, Well washed, and free of rough patches. {14.13}

source: ཕྱག་དར་དྲི་མ་མེད་པ་ཡི། །དུ་གུ་ལ་ཡི་རས་ཉིད་ལ། །རྒྱུ་ནི་ཤིང་ཀུན་ཉིད་དང་ནི། །དག་ལ་རྒྱུད་ནི་རྣམ་སྤངས་པ། །
en: “One can use a white and dust-free Cloth of dukūla bark, Flaxen cloth, or cloth of any bark, Pure and free of fibers. {14.14}

source: ཆུ་ངན་ལས་ནི་བཀྲུས་མིན་དང་། །སྐྱེ་བོས་ཞལ་མཐོང་ཕུལ་བའང་མིན། །
en: “It should not be produced by worms, Or received from people as a gift.

source: མ་བགོས་པ་དང་དེ་བཞིན་དུ། །གཞན་ཡང་ཅུང་ཟད་དམ་པས་བསྔགས། །
en: Thus it should not be silken, But any other kind described as suitable. {14.15}

source: དེ་འདྲའི་རས་ནི་བཟང་པོ་ལ། །གཞལ་མེད་ཁང་ནི་བྲི་བར་བྱ། །
en: “On such a superior cloth One should draw the palace.

source: འོད་ཀྱི་དཀྱིལ་འཁོར་ཕྲེང་བ་ཅན། །སྟོན་པའི་གཟུགས་ནི་ཡང་དག་བྲི། །
en: One should draw the likeness of the Teacher Garlanded by a circle of light. {14.16}

source: དེ་བཞིན་གསེར་གྱི་མདོག་ཅན་ནི། །འོད་ཟེར་ཕྲེང་ལྡན་བྲི་བར་བྱ། །
en: “He should be painted a golden color, Haloed by light, sage-like,

source: གཅིག་པུ་ཕུག་ན་བཞུགས་པ་ནི། །རི་བོ་ལ་གནས་གྲགས་པ་ཆེ། །
en: Alone, sheltered inside a cave On a mountain, in all his splendor. {14.17}

source: དར་ལའི་བླ་རེ་བྲེ་བ་ནི། །རིན་ཆེན་ཕྲེང་བ་འཕྱང་བའོ། །
en: “One should draw a silken canopy Strung with garlands of jewels.

source: སྟེང་དུ་ལྷ་ནི་གཉི་ག་ཡང་། །འཛིན་པ་དག་ནི་ཡང་དག་བྲི། །
en: Behind it are two gods Who are supporting it. {14.18}

source: རི་རྣམས་ཀྱི་ནི་སྟེང་དག་ཏུ། །རིན་ཆེན་ཕྲེང་བ་རབ་ཏུ་བྱ། །
en: “Above the mountain One should draw a jewel garland

source: བླ་རེའི་འཁོར་ཡུག་མུ་ཏིག་གི། །དྲ་བ་དྲ་ཕྱེད་དག་གིས་བརྒྱན། །
en: And, around the canopy, Decorations made of strings of pearls. {14.19}

source: རི་རྒྱལ་སྟེང་དུ་འབད་པ་ཡིས། །འདི་དག་ཐམས་ཅད་བྲི་བར་བྱ། །
en: “Having carefully painted all this Above the king of mountains,

source: རི་བོ་དག་གི་རྩ་བ་ཡང་། །རྒྱ་མཚོ་ཆེན་པོར་ནུབ་པར་བྱ། །
en: At the foot of the mountain One should draw the waters of the great ocean. {14.20}

source: རས་རིས་མཐར་ཡང་མེ་ཏོག་ནི། །ཀུན་ནས་འཁོར་བར་ཡང་དག་བྲི། །ནཱ་ག་གེ་སར་པུན་ནཱ་ག །བ་ཀུ་ལ་དང་ཞུ་ཏི་ཀ །
en: “Around the edges of the canvas, One should draw flowers, such as The blossoms of the ironwood tree, pannay tree, Bulletwood tree, juhi jasmine, {14.21}

source: སྣ་མའི་མེ་ཏོག་པྲི་ཡང་ཀུ། །དེ་བཞིན་ཀུ་ར་བ་ཀ་དང་། །ཨུཏྤ་ལ་དང་དྲི་མཆོག་དང་། །དེ་ལས་གཞན་ཡང་པདྨ་དཀར། །
en: “Royal jasmine, and beautyberry. Always include red amaranth, Fragrant blue lotuses, And, further, white lotuses. {14.22}

source: མེ་ཏོག་རིགས་ནི་སྣ་ཚོགས་དང་། །དེ་བཞིན་གཞན་ཡང་དྲིར་ལྡན་པའི། །མེ་ཏོག་དག་ནི་འདི་དག་ཉིད། །གང་ཡང་རུང་བ་རྟག་བླངས་ནས
en: “One should draw these different varieties And other fragrant species of flowers. One should always draw Only flowers of the species as described. {14.23}

source: སྟོན་པ་ལ་ནི་མཆོད་དོན་དུ། །ཡིད་དུ་འོང་བའི་མཆོད་ཡོན་དབུལ། །སྔ
en: “One should make offerings pleasing to the Teacher In order to worship him.

source: ར་བསྟན་ཆོ་གས་རས་རིས་ནི། །མཆོག་དང་དེ་བཞིན་གཞན་དག་ཀྱང་། །
en: Following the previously described procedure In regard to the superior painting, or the others, {14.24}

source: དོག་པ་ཐ་ག་པ་དག་དང་། །རི་མོ་མཁན་ཡང་དེ་བཞིན་འདོད། །
en: “And having ensured that the skein, the weaver, And the painter are as desired,

source: ཆོ་འཕྲུལ་གྱི་ནི་ཟླ་ཕྱེད་ཀྱི། །ཉི་མ་དགེ་བ་དག་ལ་ནི། །
en: One should do the painting during the prātihāra fortnight, On an especially auspicious day. {14.25}

source: དུས་ནི་དེ་ལྟར་གྱུར་པ་ལ། །བཟླས་པ་ཉིད་ཀྱང་བྱ་བ་ཡིན། །
en: “When such a time has arrived One should do the prescribed mantra recitation.

source: འདི་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས། །སྔར་བསྟན་བཞིན་དུ་ཡང་དག་སྤྱད། །
en: One should execute everything, in every detail, Just as previously explained. {14.26}

source: ཚོན་གསལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །སྟོན་པའི་གཟུགས་ནི་བྲི་བར་བྱ། །
en: “One should paint the complete figure of the Teacher Using paints of bright and vivid colors.

source: རྣམ་པ་དུ་མར་ལྡན་པ་ཡི། །དོང་ཀའི་མེ་ཏོག་མདོག་འདྲ་དང་། །
en: He should be fully endowed with his many aspects, Equal in splendor to the karnikara flower. {14.27}

source: ཙམ་པ་ཀ་ཡི་མདོག་འདྲ་དང་། །གསེར་གྱི་མདོག་དང་འདྲ་བར་བྲི། །དེ་ལྟའི་རྣམ་པ་ལྡན་པ་ཡི། །རིན་ཆེན་རིགས་སྐྱེས་ཐུབ་པ་བྲི། །
en: “One should paint this sage, born into the Jewel family, In golden color, With the same hue as the champak flowers And possessing all the features as described. {14.28}

source: ཆགས་པ་ཆེན་པོ་རིན་ཆེན་ཏོག །གཙོ་བོ་ཐུབ་མཆོག་དམ་པ་ནི། །
en: “He is the highly illustrious Ratnaketu, The most eminent and best of sages.

source: ཆོས་རྣམས་ཐམས་ཅད་ཡོངས་ཐོབ་པའི། །སངས་རྒྱས་དཀོན་མཆོག་དེ་བྲི་བྱ། །
en: One should paint this jewel among buddhas Who has control over all phenomena. {14.29}

source: རིན་ཆེན་རི་བོར་གནས་པ་དང་། །རིན་ཆེན་ཕུག་གིས་ཉེར་མཛེས་ཤིང་། །སྐྱིལ་ཀྲུང་གིས་ནི་བཞུགས་པ་དང་། །ཆོས་ནི་རྗེས་སུ་འཆད་ཅིང་སྩོལ། །
en: “He sits on a jewel mountain, Adorned with jewel caves, In a cross-legged posture, Delivering a Dharma discourse. {14.30}

source: ཅུང་ཟད་འཛུམ་ཞིང་བརྟན་པ་དང་། །ཐུགས་ནི་བསམ་གཏན་ལ་དམིགས་དང་། །
en: “With a gentle smile on his face, This hero’s mind is steeped in concentration.

source: ཕྱི་རོལ་ཕུག་ནི་ཡང་དག་བྲི། །འོག་དང་དེ་བཞིན་འཁོར་ཡུག་ཏུའོ། །
en: One should also paint whatever is On the outside of his cave, below, and around it. {14.31}

source: རས་མཐའི་ཟུར་དུ་སྒྲུབ་པ་པོས། །པུས་མོའི་ལྷ་ང་ཡང་དག་བཙུགས། །
en: “In the corner at the end of the canvas one should paint The practitioner, kneeling down.

source: བདུག་སྤོས་ལག་ན་ཐོགས་བཞིན་དུ། །ལུས་ནི་ཅུང་ཟད་འདུད་པ་དང་། །
en: In his extended hand he holds incense, And his body is slightly bent forward. {14.32}

source: བླ་གོས་གཅིག་ཏུ་བྱས་ནས་ནི། །ཆ་བྱད་ཇི་ལྟ་བཞིན་དུ་ཡང་། །བཅོམ་ལྡན་འདས་ཀྱི་གཡས་ཕྱོགས་ཀྱི། །འོག་གི་རྒྱ་མཚོ་ཆེ་སྟེང་དུ། །
en: “One should paint him as wearing an upper garment And other clothes just as in real life, Above the great ocean that is To the lower right of the Blessed One. {14.33}

source: སྔགས་པས་དགེ་བའི་དོན་གྱི་ཕྱིར། །སྡོམ་བརྩོན་རྟག་ཏུ་བྲི་བར་བྱ། །
en: “One should draw him—the practitioner of mantra who aspires for perfection — Wholly applying oneself to the task.

source: ལས་ཀྱི་ཆོ་ག་འདི་དག་ནི། །འཇིག་རྟེན་གྱི་སྔགས་བསྟན་པ་ཡིན། །
en: This is the procedure of doing the painting, As has been taught by those venerated by the world;

source: དཀྱིལ་འཁོར་དེ་ཡི་ལྷ་དག་ཀྱང་། །ད་ནི་རབ་ཏུ་བརྗོད་པར་བྱ། །
en: Now will be taught The maṇḍala of the deity. {14.34}

source: དེ་ཚེ་སྔགས་པས་རིག་པའི་སྔགས། །དེ་ཚེ་སྔགས་ནི་རིག་པ་དེས། །
en: “The mantra practitioner should really understand The mantra at the time of employing it

source: སྔགས་ལ་རྟག་ཏུ་བསྙེན་བྱས་དང་། །བཟླས་པ་ཕུན་སུམ་ཚོགས་མངོན་ཤེས། །
en: And always use it to do the preliminary practice, Training thus for success in recitation. {14.35}

source: འཇམ་དབྱངས་ཆོ་ག་འདི་ལ་ནི། །དེ་ཚེ་སྔགས་པ་དབང་བསྐུར་བ། །དཀྱིལ་འཁོར་རྣམ་པ་ལ་མཁས་ཤིང་། །རྟག་ཏུ་གཙང་སྦྲ་བྱེད་པ་དང་། །
en: “For this reason he should be initiated into the mantra From this manual, so beautifully taught— The mantra that is associated with the maṇḍala conduct And always requires initiation. {14.36}

source: སྔགས་རྣམས་ཀུན་ལ་དབང་བསྐུར་དང་། །དཀྱིལ་འཁོར་འདི་ལ་འཇིགས་པ་མེད། །
en: “He should have confidence in the maṇḍala, Be initiated into all its mantras,

source: རིག་པའི་སྔགས་དང་སྔགས་བཅས་དང་། །བདག་ཉིད་བསྲུང་དང་ཕན་འདོད་དང་། །
en: Always apply himself to the tantra, And be able to perform the rite of self-protection. {14.37}

source: གྲོགས་ཀྱང་དེ་བཞིན་བསྲུང་ཤེས་དང་། །ཡོངས་སུ་ལེགས་བརྟགས་འོད་ཆེན་ལྡན། །
en: “The master, possessed of great splendor, should also protect His assistants with demon-slaying [mantras] and examine them carefully.

source: སློབ་དཔོན་ལེགས་པར་ཡང་དག་རྩོམ། །རྩོམ་ཞིང་སྦྱངས་ཡོན་བསྟེན་པ་དང་། །
en: He should be well established as a spiritual master And keep his observances. {14.38}

source: ཤེས་རབ་ཆེ་ཞིང་ལེགས་འཇམ་དང་། །དཔལ་ལྡན་སྙིང་རྗེར་རྟག་ཏུ་ལྡན། །
en: “He should have profound insight, be always gentle, Noble, and compassionate,

source: གྲོགས་པོ་དག་ནི་ཐམས་ཅད་ཀྱང་། །མཚན་ཉིད་དེ་བཞིན་ཀུན་ཏུ་བསྟན། །
en: And look for the same characteristics In all his assistants. {14.39}

source: གཅིག་གཉིས་གསུམ་དང་དེ་བཞིན་དུ། །གཞན་ཡང་དེ་བཞིན་བརྒྱད་ཀྱི་བར། །སློབ་མ་ལེགས་པར་སྦྱང་བར་བྱ། །མང་པོ་དག་ནི་སྤང་བར་བྱ། །
en: “One should accept as disciples those who are well qualified— One, two, or three, Or perhaps eight or more of them— But avoid [accepting too] many. {14.40}

source: སྔར་བསྟན་ཆོ་ག་ཇི་ལྟ་བར། །དཀྱིལ་འཁོར་འདི་ལའང་ཡང་དག་སྤྱད། །
en: “One should always follow, for this maṇḍala, The procedure as previously explained.

source: སྟོབས་བཅུ་ལྡན་པས་དང་པོར་ནི། །དཀྱིལ་འཁོར་གང་དག་རབ་བསྟན་པ། །
en: Those possessing the ten powers declared This to be the best of maṇḍalas.

source: འཇམ་པའི་དབྱངས་ལས་གཞན་མིན་དང་། །རྒྱུ་གཞན་དག་གིས་བྲི་མི་བྱ། །
en: One should therefore draw no other maṇḍala, And follow no other rite but Mañjughoṣa’s. {14.41}

source: དཀྱིལ་འཁོར་འོད་ཆེན་ལྡན་པ་ཡི། །ཚད་ནི་རབ་ཏུ་བསྟན་པར་བྱ། །
en: “I will now give the measurements Of this very magnificent maṇḍala.

source: ཁྲུ་བཞིའམ་ཁྲུ་ནི་གཉིས་པ་དང་། །དེ་བཞིན་གཞན་ཡང་ཁྲུ་བརྒྱད་པར། །
en: It should be four cubits, two cubits, Or perhaps eight, or more, in diameter. {14.42}

source: གཙང་བའི་ཕྱོགས་སམ་ཆུ་ཀླུང་ངམ། །ཁྱད་པར་དུ་ནི་རི་བོའི་རྩེར། །
en: “One should draw it in a clean place, Especially a riverbank or a mountaintop.

source: ཚོན་སྣ་ལྔ་ཡི་ཕྱེ་མ་དང་། །སྔར་བསྟན་པ་ཡི་ལས་ཀྱིས་སོ། །
en: One should use powders of five colors And follow the previously taught procedure. {14.43}

source: གྲུ་བཞི་སྒོ་ནི་བཞི་པ་དང་། །རྟ་བབས་བཞི་ཡིས་བརྒྱན་པ་དང་། །
en: “The maṇḍala should have four corners, four doors, And be adorned with four gateways.

source: ཟུར་བཞི་མཉམ་ཞིང་བཟང་བ་དང་། །ལྷ་ཡི་རྣམ་པ་འདྲ་བའི་མདོག །
en: Its four sides should be of equal length, And its splendor should equal a divine enclosure. {14.44}

source: ཚོན་རྩི་གསལ་བ་སྣ་ཚོགས་དང་། །མཛེས་པའི་ཁ་དོག་ལེགས་མཛེས་དང་། །དྲི་ཞིམ་བཟང་དང་གཟུགས་བཟང་དང་། །
en: “The paints should be of bright, vivid colors, Pure and beautiful, With a nice fragrance and other aspects.

source: གྲོགས་བཟང་དག་གིས་ཡང་དག་བརྩམ། །
en: One should start painting it with the help of a companion, {14.45}

source: ཐུབ་པའི་བརྟུལ་ཞུགས་ཡང་དག་སྤྱད། །ཡན་ལག་བརྒྱད་པའི་བརྟུལ་ཞུགས་བསྟེན། །
en: “While observing silence and one’s temporary vows, As well as the eight [precepts].

source: ཉོན་མོངས་མེད་སེམས་ཟས་ཚོད་རིག །ཆོས་ལྡན་རྟག་ཏུ་ཟློས་པ་བྱེད། །
en: One should be untroubled in mind, moderate in eating, And virtuous; continually recite the mantra; {14.46}

source: སྡིག་མེད་ལས་དང་ཡོངས་སྲུང་བྱེད། །དེ་བཞིན་ཞི་དང་རྒྱས་པ་ཤེས། །
en: “And refrain from evil activities, Performing only those of pacifying and enriching.

source: དེ་ནས་དཀྱིལ་འཁོར་དབུས་ཞུགས་ནས། །བསྟན་བཅོས་ལས་གསུངས་བཞིན་དུ་བྲི། །
en: One should start in the center And draw the Teacher using paints. {14.47}

source: རིན་ཆེན་ལྷ་ཚོགས་ཀྱིས་བརྒྱན་པའི། །རི་མོ་དང་པོར་བྲི་བར་བྱ། །དེར་བཞུགས་གཟི་བརྗིད་ཆེན་པོ་ནི། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག །
en: “First, one should paint Tathāgata Ratnaketu, Complete with adornments of various jewels, Sitting inside a cave, And of great splendor. {14.48}

source: སྐྱིལ་ཀྲུང་གིས་ནི་ལེགས་བཞུགས་པ། །ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་བསྐོར་བའོ། །
en: “He sits in a cross-legged posture And turns the wheel of Dharma.

source: རས་རིས་ལ་ནི་ཇི་ལྟ་བར། །བསྟན་བཅོས་ལ་སྔགས་ཐམས་ཅད་བྲི། །
en: One should draw on the canvas Everything that is normally offered to the Teacher. {14.49}

source: རི་མོའི་ཕྲེང་ནི་གསུམ་དག་དང་། །ཕྱག་རྒྱས་རབ་ཏུ་བརྒྱན་པ་དང་། །གསེར་མདོག་རིམ་པས་ཁོར་ཡུག་ཏུ། །ཡོངས་སུ་བྲི་བར་བྱ་བ་ཡིན། །
en: “It should be adorned with mudrā symbols Arranged in three rows. One should paint all that is offered, Arranged in rows all around. {14.50}

source: གསལ་དང་ཡོངས་སུ་རྫོགས་པ་དང་། །དྲང་པོ་དེ་ཡི་རྣམ་པའོ། །
en: “They should be densely packed together, Arranged in order without mixing them up.

source: འཁོར་ལོས་སྒྱུར་བའི་བདག་པོ་ཆེ། །དེ་ཡི་དབུས་སུ་བྱ་བ་ཡིན། །
en: In their center should be painted The wheel-turning lord of great power. {14.51}

source: ཉི་མ་འཆར་ཀ་འདྲ་བ་དང་། །གུར་གུམ་རྣམ་པ་འདྲ་མདོག་ཅན། །འཁོར་ལོ་ཆེན་པོའི་རྗེས་འབྲང་བ། །འབད་པར་གནས་པས་ཀུན་ཏུ་བྲི། །
en: “He has the color of the rising sun And the radiant form of a divine youth. One should paint him with care As turning the great wheel. {14.52}

source: རྒྱལ་པོ་ཆེན་པོ་མཉམ་འདྲ་བ། །གཞལ་མེད་ཁང་བཅས་རྒྱན་གྱིས་བརྒྱན། །
en: “He is in his form of a great king, Invested with a crown and other adornments,

source: སེམས་དཔའ་ཆེན་པོའི་ཅོད་པན་ཅན། །རྒྱན་རྣམས་ཀུན་གྱིས་རབ་ཏུ་བརྒྱན། །
en: Wearing a diadem of a great being, And adorned with every ornament. {14.53}

source: དར་ལ་མཛེས་པའི་སྨད་གཡོགས་ཅན། །སྣ་ཚོགས་དར་ལས་སྟོད་གཡོགས་ཤིང་། །
en: “He wears a fine silken sash around his waist And brightly colored silk garments.

source: ཕྲེང་ལྡན་ཞི་བའི་ཁ་དོག་འོད། །གོས་དང་ཕྲེང་བས་བརྒྱན་པ་དང་། །
en: He is garlanded and adorned With garlands and clothes with a gentle, soft glow. {14.54}

source: མེ་ཏོག་ཕྲེང་བ་བཀྐུ་ལ། །ལག་པ་གཡས་པས་སྣོམས་པར་བྱེད། །
en: “He inhales the fragrance of a cluster of bulletwood blossoms, Which he holds in his right hand.
